PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_scb_uart.c
/***************************************************************************//**
* \file cy_scb_uart.c
* \version 3.30
*
* Provides UART API implementation of the SCB driver.
*
********************************************************************************
* \copyright
* Copyright 2016-2025 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cy_device.h"

#if (defined (CY_IP_MXSCB) || defined (CY_IP_MXS22SCB))

#include "cy_scb_uart.h"

#if defined(__cplusplus)
extern "C" {
#endif

/* Static functions */
static void HandleDataReceive(CySCB_Type *base, cy_stc_scb_uart_context_t *context);
static void HandleRingBuffer(CySCB_Type *base, cy_stc_scb_uart_context_t *context);
static void HandleDataTransmit(CySCB_Type *base, cy_stc_scb_uart_context_t *context);
static uint32_t SelectRxFifoLevel(CySCB_Type const *base);

/*******************************************************************************
* Function Name: Cy_SCB_UART_SetOverSample
****************************************************************************//**
*
* Sets oversample bits of UART.
*
* \param base
* The pointer to the UART SCB instance.
*
* \param overSample
* Value of oversample to be set.
*
* \param context
* The pointer to the context structure \ref cy_stc_scb_uart_context_t allocated
* by the user. The structure is used during the UART operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
* User should not pass NULL as pointer to context.
*
* \return
* \ref cy_en_scb_uart_status_t
*
* \note
* Ensure that the SCB block is disabled before calling this function.
*
* \snippet scb/uart_snippet/main.c UART_SET_OVS
*
*******************************************************************************/
cy_en_scb_uart_status_t Cy_SCB_UART_SetOverSample(CySCB_Type *base, uint32_t overSample, cy_stc_scb_uart_context_t *context)
{
    CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.8', 1, \
                                 'Intentional typecast to cy_en_scb_uart_mode_t enum to validate arguments.')
    if ((NULL == base) || (NULL == context) ||
            ((CY_SCB_UART_IS_OVERSAMPLE_VALID(overSample, ((cy_en_scb_uart_mode_t)_FLD2VAL(SCB_UART_CTRL_MODE, SCB_UART_CTRL(base))), context->irdaEnableLowPowerReceiver)) == false))
    {
        return CY_SCB_UART_BAD_PARAM;
    }
    CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.8')

    uint32_t ovs;

    if (((uint32_t)CY_SCB_UART_IRDA == _FLD2VAL(SCB_UART_CTRL_MODE, SCB_UART_CTRL(base))) && (!context->irdaEnableLowPowerReceiver))
    {
        /* For Normal IrDA mode oversampling is always zero */
        ovs = 0UL;
    }
    else
    {
        ovs = overSample - 1UL;
    }

    /* Set oversample bits */
    CY_REG32_CLR_SET(SCB_CTRL(base), SCB_CTRL_OVS, ovs);

    return CY_SCB_UART_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_SCB_UART_SetDataWidth
****************************************************************************//**
*
* Sets datawidth for UART transaction.
*
* \param base
* The pointer to the UART SCB instance.
*
* \param dataWidth
* The width of UART data in the UART transaction.
*
* \note
* Ensure that the SCB block is disabled before calling this function.
*
* \snippet scb/uart_snippet/main.c UART_SET_DATA_WIDTH
*
*******************************************************************************/
void Cy_SCB_UART_SetDataWidth(CySCB_Type *base, uint32_t dataWidth)
{
    CY_ASSERT_L2(CY_SCB_UART_IS_DATA_WIDTH_VALID(dataWidth));

    /* Configure the memory width */
    Cy_SCB_SetByteMode(base, (dataWidth <= CY_SCB_BYTE_WIDTH));

    CY_REG32_CLR_SET(SCB_RX_CTRL(base), SCB_RX_CTRL_DATA_WIDTH, (dataWidth - 1UL));

    CY_REG32_CLR_SET(SCB_TX_CTRL(base), SCB_TX_CTRL_DATA_WIDTH, (dataWidth - 1UL));
}

/*******************************************************************************
* Function Name: Cy_SCB_UART_SetParity
****************************************************************************//**
*
* Sets parity for UART transaction.
*
* \param base
* The pointer to the UART SCB instance.
*
* \param parity
* The UART parity bit in the UART transaction.
*
* \note
* Ensure that the SCB block is disabled before calling this function.
*
* \snippet scb/uart_snippet/main.c UART_SET_PARITY
*
*******************************************************************************/
void Cy_SCB_UART_SetParity(CySCB_Type *base, cy_en_scb_uart_parity_t parity)
{
    CY_ASSERT_L3(CY_SCB_UART_IS_PARITY_VALID(parity));

    /* Configure the RX direction with given parameters */
    CY_REG32_CLR_SET(SCB_UART_RX_CTRL(base), CY_SCB_UART_RX_CTRL_SET_PARITY, (uint32_t) parity);

    /* Configure the TX direction with given parameters*/
    CY_REG32_CLR_SET(SCB_UART_TX_CTRL(base), CY_SCB_UART_TX_CTRL_SET_PARITY, (uint32_t) parity);
}

/*******************************************************************************
* Function Name: Cy_SCB_UART_SetStopBits
****************************************************************************//**
*
* Sets stop bits for UART transaction.
*
* \param base
* The pointer to the UART SCB instance.
*
* \param stopBits
* The number of stop bits in the UART transaction.
*
* \note
* Ensure that the SCB block is disabled before calling this function.
*
* \snippet scb/uart_snippet/main.c UART_SET_STOP_BITS
*
*******************************************************************************/
void Cy_SCB_UART_SetStopBits(CySCB_Type *base, cy_en_scb_uart_stop_bits_t stopBits)
{
    CY_ASSERT_L3(CY_SCB_UART_IS_STOP_BITS_VALID(stopBits));

    /* Configure the RX direction with given parameters */
    CY_REG32_CLR_SET(SCB_UART_RX_CTRL(base), SCB_UART_RX_CTRL_STOP_BITS, ((uint32_t) stopBits) - 1UL);

    /* Configure the TX direction with given parameters*/
    CY_REG32_CLR_SET(SCB_UART_TX_CTRL(base), SCB_UART_TX_CTRL_STOP_BITS, ((uint32_t) stopBits) - 1UL);
}

